/*
 * Типи подій: keypress, keydown, keyup
 * - Обмеження keypress
 * - Властивості key та code
 */

//* 1. keydown
// Спрацьовує, коли клавіша натискається вниз.
// Викликається до того, як символ з’явиться в полі введення (якщо це текстова клавіша).
// Спрацьовує для всіх клавіш, включаючи Shift, Ctrl, Alt, Arrow, Escape тощо.
// ✅ Використовується, коли потрібно реагувати на будь-яке натискання клавіш, наприклад, для створення гарячих клавіш або ігрового керування.

//* 2. keypress (Застарілий!)
// Викликається коли натискається друкована клавіша (буква, цифра, символ).
// Не спрацьовує для Shift, Ctrl, Alt, Escape, Arrow тощо.
// Вважається застарілим (deprecated) і не використовується у сучасних браузерах.
// Його замінює keydown, який надає більше інформації про клавішу.

//* 3. keyup
// Спрацьовує, коли клавіша відпускається.
// Викликається після того, як символ з’явився (якщо це текстова клавіша).
// Корисний для виявлення, коли користувач завершив введення або відпустив клавішу управління.
// ✅ Використовується, коли потрібно відстежити завершення натискання, наприклад, щоб прибрати ефект або обробити введені дані.

//* code - зберігає код клавіші в не залежності від мови (розкладки) користувача, грубо кажучи код привʼязаний до фізичного розташування клавіші. Можна використовувати в тих випадках, коли потрібно щоб комбінація працювала в не залежності від мови

//* key - зберігає символ клавіші на тій розкладці клавіатури яка стоїть у користувача під час натискання (постійно змінюється в залежності від символу)

/*
 * Обробка комбінацій клавіш
 */

document.addEventListener("keydown", handleKeyDown);

// function handleKeyDown(event) {
//   console.log(event);
// }

function handleKeyDown(event) {
  console.log(event);
  if (event.code === "KeyC" && (event.ctrlKey || event.metaKey)) {
    event.preventDefault();
    console.log("Копіювання контенту заборонено, купи підписку!");
  }
}

// https://developer.mozilla.org/en-US/docs/Mozilla/Add-ons/WebExtensions/Interact_with_the_clipboard
